//--------------------------------------------------------------
// File     : stm32_ub_usb_msc_host.h
//--------------------------------------------------------------

//--------------------------------------------------------------
#ifndef __STM32F1_UB_USB_MSCHOST_H
#define __STM32F1_UB_USB_MSCHOST_H


//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32f10x.h"
#include "usbh_usr.h"
#include "stm32_ub_fatfs.h"




//--------------------------------------------------------------
// Статус соединения USB
//--------------------------------------------------------------
typedef enum {
  USB_MSC_HOST_NO_INIT =0,   // интерфейс USB не инициализирован 
  USB_MSC_DEV_DETACHED,      // нет подключенного устройства
  USB_MSC_SPEED_ERROR,       // Скорость USB не поддерживается
  USB_MSC_DEV_NOT_SUPPORTED, // Устройство не поддерживается
  USB_MSC_DEV_WRITE_PROTECT, // Устройство защищено от записи
  USB_MSC_OVER_CURRENT,      // Перегрузка по току
  USB_MSC_DEV_CONNECTED      // Устройство подключено и готово
}USB_MSC_HOST_STATUS_t;
USB_MSC_HOST_STATUS_t USB_MSC_HOST_STATUS;



//--------------------------------------------------------------
// Глобальная функция
//--------------------------------------------------------------
void UB_USB_MSC_HOST_Init(void);
USB_MSC_HOST_STATUS_t UB_USB_MSC_HOST_Do(void);


//--------------------------------------------------------------
#endif // __STM32F1_UB_USB_MSCHOST_H
