//--------------------------------------------------------------
// File     : stm32_ub_led.h
//--------------------------------------------------------------

//--------------------------------------------------------------
#ifndef __STM32F4_UB_LED_H
#define __STM32F4_UB_LED_H

//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"




//--------------------------------------------------------------
// Список всех светодиодов
// Номера не дублируются, начинаются с 0
//--------------------------------------------------------------
typedef enum 
{
  LED_GREEN = 0,  // LED4 на STM32F4-Discovery
  LED_ORANGE = 1, // LED3 на STM32F4-Discovery
  LED_RED = 2,    // LED5 на STM32F4-Discovery
  LED_BLUE = 3    // LED6 на STM32F4-Discovery
}LED_NAME_t;

#define  LED_ANZ   4 // Количество LED_NAME_t


//--------------------------------------------------------------
// Индикатор состояния светодиодов
//--------------------------------------------------------------
typedef enum {
  LED_OFF = 0,  // Светодиод выключен
  LED_ON        // Светодиод включен
}LED_STATUS_t;


//--------------------------------------------------------------
// Структура инициализации светодиода
//--------------------------------------------------------------
typedef struct {
  LED_NAME_t LED_NAME;    // Name
  GPIO_TypeDef* LED_PORT; // Port
  const uint16_t LED_PIN; // Pin
  const uint32_t LED_CLK; // Clock
  LED_STATUS_t LED_INIT;  // Init
}LED_t;


//--------------------------------------------------------------
// Глобальные функции
//--------------------------------------------------------------
void UB_Led_Init(void);
void UB_Led_Off(LED_NAME_t led_name);
void UB_Led_On(LED_NAME_t led_name);
void UB_Led_Toggle(LED_NAME_t led_name);
void UB_Led_Switch(LED_NAME_t led_name, LED_STATUS_t wert);



//--------------------------------------------------------------
#endif // __STM32F4_UB_LED_H
